// QUESTIONS
const QS=[
  {q:"जैन धर्म में कुल कितने मूल सिद्धांत है ?",o:["5","6","8","2"],a:1},
  {q:"जीवों को ना मारना ये कौनसा सिद्धांत हैं ?",o:["अपरिग्रहवाद","अनेकांतवाद","अहिंसा","कोई नहीं"],a:2},
  {q:"प्रत्येक वस्तु का भिन्न-भिन्न दृष्टि से विचार करना , परखना , देखना।",o:["अनेकांतवाद","स्याद्वाद","अहिंसा","अपरिग्रहवाद"],a:0},
  {q:"इस सृष्टि को ना ही किसी ने बनाया और ना कोई चलाता है, यह कौनसा सिद्धांत हैं ?",o:["अवतारवाद नहीं","अहिंसा","सृष्टिअकर्तत्व","इसको भगवान चलाते है"],a:2},
  {q:"हर जीव भगवान बन सकता है , यह कौनसा सिद्धांत है ?",o:["आत्म स्वातंत्र्य","सृष्टिअकर्तत्व","अवतारवाद नहीं","सिर्फ तीर्थंकर मोक्ष जाते है"],a:0},
  {q:"एक बार मोक्ष जाने के बाद वापस नहीं आते ?",o:["अवतारवाद नहीं","अहिंसा","सृष्टिअकर्तत्व","सिर्फ तीर्थंकर मोक्ष जाते है"],a:0},
  {q:"कुल कितने तीर्थंकर होते है ?",o:["21","23","24","infinite"],a:2},
  {q:"महावीर भगवान का कौनसा चिन्ह है ?",o:["Snake","Deer","Lion","Cow"],a:2},
  {q:"महावीर जयंती के दिन क्या हुआ था ?",o:["भगवान का मोक्ष","भगवान का जन्म","भगवान का आहार","कोई नहीं"],a:1},
];
function pickQ(n){return[...QS].sort(()=>Math.random()-.5).slice(0,n)}
