// QUESTIONS
const QS=[
  {q:"हमने जैन धर्म के कुल कितने मूल सिद्धांत पढ़े हैं ?",o:["5","6","8","2"],a:1},
  {q:"जीवों को नहीं मारना - ये कौन सा सिद्धांत हैं ?",o:["अपरिग्रहवाद","अनेकांतवाद","अहिंसा","कोई नहीं"],a:2},
  {q:"हमारे पास जो भी आवश्यकता से अधिक हो, हमें वो किसी को donate कर देना चाहिए। ऐसा करना जैन धर्म के किस सिद्धांत को follow करना कहलायेगा ? ",o:["अनेकांतवाद","स्याद्वाद","अहिंसा","अपरिग्रहवाद"],a:3},
  {q:"इस सृष्टि को ना ही किसी ने बनाया, ना कोई चलाता है और न ही कोई मिटा सकता है ? यह कौन सा सिद्धांत हैं ?",o:["अवतारवाद नहीं","अहिंसा","सृष्टिअकर्तत्व","इसको भगवान चलाते है"],a:2},
  {q:"हर जीव में भगवान बनने की शक्ति है - यह कौन सा सिद्धांत है ?",o:["आत्म स्वातंत्र्य","सृष्टिअकर्तत्व","अवतारवाद नहीं","सिर्फ तीर्थंकर मोक्ष जाते है"],a:0},
  {q:"जो जीव एक बार मोक्ष चला जाता है, वो कभी वापस जन्म नहीं लेता। - ये कौन सा सिद्धांत है ?",o:["अवतारवाद नहीं","अहिंसा","सृष्टिअकर्तत्व","सिर्फ तीर्थंकर मोक्ष जाते है"],a:0},
  {q:"जैन कौन होते हैं ?",o:["केवल अपने नाम के आगे जैन लगाने वाले","जो लोग नॉन वेज खाते हैं पर मंदिर जाते हैं","जिनेन्द्र भगवान और उनके द्वारा बताये गए सिद्धांतों को मानने वाले","भारत में रहने वाले "],a:2},
  {q:"महावीर भगवान का कौनसा चिन्ह है ?",o:["Snake","Deer","Lion","Cow"],a:2},
  {q:"हम सब महावीर जयंती क्यों मनाते हैं ?",o:["भगवान का मोक्ष","भगवान का जन्म","भगवान का आहार","कोई नहीं"],a:1},
];
function pickQ(n){return[...QS].sort(()=>Math.random()-.5).slice(0,n)}
